from random import choice

answers = {
    0: 'Иначе и быть не может', 1: 'Бесспорно', 2: 'Мне кажется - да', 3: 'Пока неясно, попробуй снова', 4: 'Даже не думай!', 5: 'Предрешено', 6: 'Вероятнее всего', 7: 'Спроси позже', 8: 'Мой ответ - нет',
    9: 'Никаких сомнений', 10: 'Хорошие перспективы', 11: 'Лучше не рассказывать', 12: 'По моим данным - нет', 13: 'Определённо да', 14: 'Знаки говорят - да', 15: 'Сейчас нельзя предсказать',
    16: 'Можешь быть уверен в этом', 17: 'Да', 18: 'Сконцентрируйся и спроси снова', 19: 'Весьма сомнительно', 20: 'Перспективы не очень хорошие'
}

print('Привет! Я цыганский шар, и я знаю ответ на любой твой вопрос.')
username = input('Подскажи, как тебя зовут: ')
print(f'Приветствую тебя, {username}')

while True:
    question = input('Задай свой вопрос, ромалэ: ')
    response = choice(answers)
    print(response)
    q_r = input('Хочешь задать еще вопрос?\n')
    if q_r.lower() == 'нет':
        print('Позолоти ручку')
        break
    else:
        continue